satf-233/Line-follower-robot/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 开启 BLE (Bluedroid)，用于向电脑发送 MJPEG 帧
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=n
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_GATTS_ENABLE=y
# 使用传统 BLE 4.2 广播 API (esp_ble_gap_start_advertising 等)，
# 关闭 BLE 5.0 扩展广播 (它们互斥，且本服务不需要 5.0)
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=n
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
